cf/InformationRegisters/Комментарии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>Комментарии</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вложения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КомментируемыеОбъекты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиОбъекта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/CommonModules/Комментарии/Ext/Module.bsl
Функция ПолучитьКомментарииHTMLКОбъекту(СсылкаНаОбъект, ИмяРеквизита = "", НомерСтрокиОбъекта = 0) Экспорт
	
	ТекстОграничительDIV = "<div style="" width:100%; height:1px; clear:both;""></div>";
	
	Запрос = Новый Запрос("ВЫБРАТЬ Комментарий, Вложения, Пользователь, Период ИЗ РегистрСведений.Комментарии ГДЕ СсылкаНаОбъект = &СсылкаНаОбъект
	|" + ?(ИмяРеквизита = "","","И ИмяРеквизита = """ + ИмяРеквизита + """") + "
	|" + ?(НомерСтрокиОбъекта,"И НомерСтрокиОбъекта = """ + Формат(НомерСтрокиОбъекта, "ЧГ="),"") + "
	|УПОРЯДОЧИТЬ ПО Период Убыв
	|");
	
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Текст 	= ?(СсылкаНаОбъект.Пустая(), "Объект еще не записан, комментировать не записаный объект запрещено.", "");
	
	Пока Выборка.Следующий() Цикл 
		
		текКоммент = Выборка.Комментарий;
		
		// Распакуем вложения
		ВложениеКоммента 	= Выборка.Вложения.Получить();
		Если ВложениеКоммента <> Неопределено Тогда
			Для Каждого Элемент Из ВложениеКоммента Цикл Адрес = ПоместитьВоВременноеХранилище(Элемент.Значение); текКоммент = СтрЗаменить(текКоммент, "<img src='" + Элемент.Ключ + "'", "<img src='" + Адрес + "'"); КонецЦикла; КонецЕсли;
		
		Текст = Текст + "
		|<div class=""autor"">" + Выборка.Пользователь + "   " + Формат(Выборка.Период, "ДЛФ=DDT") + "</div>
		|<div class=""Comment"">" + текКоммент + "</div>"; КонецЦикла;
		
	Возврат "<!DOCTYPE html PUBLIC ""-//W3C//DTD XHTML 1.0 Strict//EN"" ""http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd"">
			|<html xmlns=""http://www.w3.org/1999/xhtml"" xml:lang=""ru"">
			|<head>
			|	<meta http-equiv=""Content-Type"" content=""text/html"" />
			|	<style>
			|		.Comment{
			|				width:100%; 
        	|				padding:2px;
        	|				float:left; 
        	|				margin-left:15px; 
			|				margin-right:15px;
			|				margin-top:5px;
        	|				text-align:left;
			|			}
			|		.autor{
			|				background:#EDF2F0; 
            |       		white-space: nowrap;
			|				margin-top:20px;
           	|               font-size:65%;
          	|               color:grey;
         	|               overflow: hidden; width:100%; 
			|				height:15px;
			|			}
			|	</style>
			|</head>
			|<body>
			|" + ?(СсылкаНаОбъект.Пустая(), "", "
			|<a href='V8:ВЫПОЛНИТЬ КОД:ОткрытьФорму(""РегистрСведений.Комментарии.Форма.ДобавитьКомментарий"", Новый Структура(""СсылкаНаОбъект"", ЭтаФорма.СсылкаНаОбъект), ЭтаФорма);'>Добавить новый комментарий</a>
			|") + "
			|" + ТекстОграничительDIV + "
			|" + Текст + "
			|</body>
			|</html>";
	
КонецФункции
